CSI API ETABS v1

# cViewRefreshWindow Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int RefreshWindow(
    	int Window = 0
    )

    Function RefreshWindow (
    	Optional Window As Integer = 0
    ) As Integer

    Dim instance As cView
    Dim Window As Integer
    Dim returnValue As Integer

    returnValue = instance.RefreshWindow(Window)

    int RefreshWindow(
    	int Window = 0
    )

    abstract RefreshWindow :
            ?Window : int
    (* Defaults:
            let _Window = defaultArg Window 0
    *)
    -> int

#### Parameters

Window (Optional)

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cView Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com